class Settings:
    def __init__(self):
        self.LOGIN = '19378184718'
        self.PASSWORD = 'apsydWUAMbW'
        self.DELAY = 3
        self.PROXY = False
        self.LIST_MESSAGE = ['Заходите, лучший чатик для геев Воронежа! https://new.transseksualki-voronezha.com/gay-chat']
        self.PHOTOS = []
        self.PROXY_LIST = ({'http': 'IP:PORT'})


    def get_banner(self):
        BANNER = '''
        
            ██████╗░███████╗██████╗░██╗░░░██╗░█████╗░███╗░░██╗░█████╗░██╗░░██╗
            ██╔══██╗██╔════╝██╔══██╗██║░░░██║██╔══██╗████╗░██║██╔══██╗██║░░██║
            ██████╔╝█████╗░░██████╔╝╚██╗░██╔╝██║░░██║██╔██╗██║███████║███████║
            ██╔═══╝░██╔══╝░░██╔══██╗░╚████╔╝░██║░░██║██║╚████║██╔══██║██╔══██║
            ██║░░░░░███████╗██║░░██║░░╚██╔╝░░╚█████╔╝██║░╚███║██║░░██║██║░░██║
            ╚═╝░░░░░╚══════╝╚═╝░░╚═╝░░░╚═╝░░░░╚════╝░╚═╝░░╚══╝╚═╝░░╚═╝╚═╝░░╚═╝
        '''
        return BANNER


